/**
 * Created with demo.
 * Date: 2020/8/24.
 * Time: 9:16 下午.
 *
 * @author randy.
 */
package com.randy.homework;

// TODO: 2020/8/24 1. 完成一个学生，老师，人的模型
// TODO: 2020/8/24 要求：学生有发言能力，老师有讲课能力，作为人、老师和学生在行动之前需要思考，作为基础的生物需要能够进行呼吸。使用课上内容实现这个模型
// TODO: 2020/8/24 2. 完成上面的模型之后，设计一个班级的类
// TODO: 2020/8/24 要求：班级内只能存放人的子类；班级类要有添加和删除来时的方法；有更换老师的方法；支持控制台打印学生的名单

// TODO: 2020/8/27 1. 给班级类增加一个查找学生的方法
// TODO: 2020/8/27 要求：使用Optional作为返回值，泛型为学生；使用Stream+filter实现筛选学生；方法支持按自定义条件筛选学生；
// TODO: 2020/8/27 2. 给老师类增加一个学生分组功能
// TODO: 2020/8/27 要求：分组方法要求输入参数为List<学生>，按照学生的分数分组之后返回Map<String, List<学生>>的分组结果；100-60及格，0-59不及格
